halfroad/Arm/Experiments/v9.0/STM32H563ZIT6/Wireless/WirelessReceiver/Sources/Applications/User/Peripherals/Wireless/Nrf24xx/Sources/Nrf24xx.c
#include "./Communications/SerialPeripheralInterfaces/Include/SerialPeripheralInterfaces.h"

#include "../Include/Nrf24xx.h"

#ifdef STM32H563xx

/*  PD4 */
#define CHIP_ENABLE_GPIO_PORT                                           GPIOD
#define RCC_CHIP_ENABLE_GPIO_CLOCK_ENABLE()                             do                                  \
                                                                        {                                   \
                                                                            __HAL_RCC_GPIOD_CLK_ENABLE();   \
                                                                        }                                   \
                                                                        while   (0)

#define CHIP_ENABLE_GPIO_PIN                                            GPIO_PIN_4

/*  PB1 */
#define INTERRUPT_REQUEST_GPIO_PORT                                     GPIOB

#define RCC_INTERRUPT_REQUEST_GPIO_CLOCK_ENABLE()                       do                                  \
                                                                        {                                   \
                                                                            __HAL_RCC_GPIOB_CLK_ENABLE();   \
                                                                        }                                   \
                                                                        while   (0)

#define INTERRUPT_REQUEST_GPIO_PIN                                      GPIO_PIN_1
#define INTERRUPT_REQUEST_GPIO_IRQN                                     EXTI1_IRQn
#define INTERRUPT_REQUEST_GPIO_IRQHandler                               EXTI1_IRQHandler
                                                                        
#else
                                                                        
#ifdef STM32G474xx
                                                                        
/*  PD8 */
#define CHIP_ENABLE_GPIO_PORT                                           GPIOD
#define RCC_CHIP_ENABLE_GPIO_CLOCK_ENABLE()                             do                                  \
                                                                        {                                   \
                                                                            __HAL_RCC_GPIOD_CLK_ENABLE();   \
                                                                        }                                   \
                                                                        while   (0)

#define CHIP_ENABLE_GPIO_PIN                                            GPIO_PIN_8

/*  PD9 */
#define INTERRUPT_REQUEST_GPIO_PORT                                     GPIOD

#define RCC_INTERRUPT_REQUEST_GPIO_CLOCK_ENABLE()                       do                                  \
                                                                        {                                   \
                                                                            __HAL_RCC_GPIOD_CLK_ENABLE();   \
                                                                        }                                   \
                                                                        while   (0)

#define INTERRUPT_REQUEST_GPIO_PIN                                      GPIO_PIN_9
#define INTERRUPT_REQUEST_GPIO_IRQN                                     EXTI9_5_IRQn
#define INTERRUPT_REQUEST_GPIO_IRQHandler                               EXTI9_5_IRQHandler

#endif  /*  #ifdef STM32H563xx  */
#endif  /*  #ifdef STM32G474xx  */

/*

Table 20. Command set for the nRF24L01+ SPI
SPI Command Registers.

*/

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    R_REGISTER                  000A AAAA                           1 to 5
                                                                    LSByte first                    Read command and status registers. AAAAA =
                                                                                                    5 bit Register Map Address.
                                                                                 

*/
#define READ_COMMAND_AND_STATUS_REGISTERS                               0x00

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    W_REGISTER                  001A AAAA                           1 to 5 LSByte first
                                                                                                    Write command and status registers. AAAAA = 5
                                                                                                    bit Register Map Address
                                                                                                    Executable in power down or standby modes
                                                                                                    only.
*/
#define WRITE_COMMAND_AND_STATUS_REGISTERS                              0x20

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    R_RX_PAYLOAD                0110 0001                           1 to 32
                                                                    LSByte first                    Read RX-payload: 1 ¨C 32 bytes. A read operation
                                                                                                    always starts at byte 0. Payload is deleted from
                                                                                                    FIFO after it is read. Used in RX mode.
*/
#define READ_RX_PAYLOAD                                                 0x61

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    W_TX_PAYLOAD                1010 0000                           1 to 32
                                                                    LSByte first                    Write TX-payload: 1 ¨C 32 bytes. A write operation
                                                                                                    always starts at byte 0 used in TX payload.
*/
#define WRITE_TX_PAYLOAD                                                0xA0

