halfroad/Arm/Experiments/v9.0/STM32H563ZIT6/Wireless/WirelessReceiver/Sources/Applications/User/Peripherals/Wireless/Nrf24xx/Sources/Nrf24xx.c
/*

    Command name                Command word (binary)               # Data bytes                    Operation
    FLUSH_TX                    1110 0001                           0                               Flush TX FIFO, used in TX mode.
*/
#define FLUSH_TX_FIFO                                                   0xE1
/*

    Command name                Command word (binary)               # Data bytes                    Operation
    FLUSH_RX                    1110 0010                           0                               Flush RX FIFO, used in RX mode
                                                                                                    Should not be executed during transmission of
                                                                                                    acknowledge, that is, acknowledge package will
                                                                                                    not be completed.
*/
#define FLUSH_RX_FIFO                                                   0xE2
/*

    Command name                Command word (binary)               # Data bytes                    Operation
    REUSE_TX_PL                 1110 0011                           0                               Used for a PTX device
                                                                                                    Reuse last transmitted payload.
                                                                                                    TX payload reuse is active until
                                                                                                    W_TX_PAYLOAD or FLUSH TX is executed. TX
                                                                                                    payload reuse must not be activated or deacti-
                                                                                                    vated during package transmission.
*/
#define REUSE_LAST_RXTED_PAYLOAD                                        0xE3

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    R_RX_PL_WID                 0110 0000                           1                               Read RX payload width for the top
                                                                                                    R_RX_PAYLOAD in the RX FIFO.
                                                                                                    Note: Flush RX FIFO if the read value is larger
                                                                                                    than 32 bytes.
*/
#define READ_RX_PAYLOAD_WIDTH_IN_RX_FIFO                                0x60

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    W_ACK_PAYLOAD               1010 1PPP                           1 to 32
                                                                    LSByte first                    Used in RX mode.
                                                                                                    Write Payload to be transmitted together with
                                                                                                    ACK packet on PIPE PPP. (PPP valid in the
                                                                                                    range from 000 to 101). Maximum three ACK
                                                                                                    packet payloads can be pending. Payloads with
                                                                                                    same PPP are handled using first in - first out
                                                                                                    principle. Write payload: 1¨C 32 bytes. A write
                                                                                                    operation always starts at byte 0.
*/
#define WRITE_PAYLOAD_TO_RX_TOGETHER_WITH_ACK_PACKET_ON_PIPE      0xA8

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    W_TX_PAYLOAD_NOACK          1011 0000                           1 to 32
                                                                    LSByte first                    Used in TX mode. Disables AUTOACK on this
                                                                                                    specific packet.
*/
#define DISABLES_AUTOACK_ON_SPECIFIC_PACKET                             0xB0

/*

    Command name                Command word (binary)               # Data bytes                    Operation
    NOP                         1111 1111                           0                               No Operation. Might be used to read the STATUS
                                                                                                    register.
*/
#define NOP                                                             0xFF

/*

nRF24L01+Single Chip 2.4GHz Transceiver Product Specification v1.0.PDF
Addresses 18 to 1B are reserved for test purposes, altering them makes the chip malfunction.

Table 28. Register map of nRF24L01+
                                                                        
*/

#define CONFIGURATION_REGISTER                                          0x00        /*  CONFIG      */

#define ENABLE_AUTO_ACKNOWLEDGMENT                                      0x01        /*  EN_AA       */
#define ENABLED_RX_ADDRESSES                                            0x02        /*  EN_RXADDR   */

#define SETUP_OF_ADDRESS_WIDTHS                                         0x03        /*  SETUP_AW    */
#define SETUP_OF_AUTOMATIC_RETRANSMISSION                               0x04        /*  SETUP_RETR  */

#define RF_CHANNEL                                                      0x05        /*  RF_CH       */
#define RF_SETUP_REGISTER                                               0x06        /*  RF_SETUP    */

#define STATUS_REGISTER                                                 0x07        /*  STATUS      */

