halfroad/Arm/Experiments/v9.0/STM32H563ZIT6/Wireless/WirelessReceiver/Sources/Applications/User/Peripherals/Wireless/Nrf24xx/Sources/Nrf24xx.c
#define RX_OBSERVE_REGISTER                                             0x08        /*  OBSERVE_TX  */

#define RXD_POWER_DETECTOR                                              0x09        /*  RPD         */

#define RX_ADDRESS_DATA_PIPE_0                                          0x0A        /*  RX_ADDR_P0  */
#define RX_ADDRESS_DATA_PIPE_1                                          0x0B        /*  RX_ADDR_P1  */
#define RX_ADDRESS_DATA_PIPE_2                                          0x0C        /*  RX_ADDR_P2  */
#define RX_ADDRESS_DATA_PIPE_3                                          0x0D        /*  RX_ADDR_P3  */
#define RX_ADDRESS_DATA_PIPE_4                                          0x0E        /*  RX_ADDR_P4  */
#define RX_ADDRESS_DATA_PIPE_5                                          0x0F        /*  RX_ADDR_P5  */

#define TX_ADDRESS                                                      0x10        /*  TX_ADDR  */

#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_0                    0x11        /*  RX_PW_P0  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_1                    0x12        /*  RX_PW_P1  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_2                    0x13        /*  RX_PW_P2  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_3                    0x14        /*  RX_PW_P3  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_4                    0x15        /*  RX_PW_P4  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_5                    0x16        /*  RX_PW_P5  */
#define NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_5                    0x16        /*  RX_PW_P5  */

#define FIFO_STATUS                                                     0x17        /*  FIFO Status Register.  */

#define ENABLE_DYNAMIC_PAYLOAD_LENGTH                                   0x1C        /*  DYNPD  */

#define FEATURE_REGISTER                                                0x1D        /*  FEATURE  */

#define TX_MAXIMUM_RETRILS                                              0x10
#define TX_OK                                                           0x20
#define RX_OK                                                           0x40

typedef enum
{
    CRCLength0,
    CRCLength1,
    
} CRCLengths;

typedef enum
{
    TxOutputPower_18dBm,
    TxOutputPower_12dBm ,
    TxOutputPower_6dBm  ,
    TxOutputPower0dBm   ,

} TxOutputPowers;

const uint8_t TRANSMITTER_ADDRESS[ADDRESS_WIDTH]                     = { 0x4C, 0xE6, 0xC0, 0x36, 0x01 };
const uint8_t RECEIVER_ADDRESS[ADDRESS_WIDTH]                        = { 0x4C, 0xE6, 0xC0, 0x36, 0x02 };

static void ChipEnable(ChipEnablements enablement);

void InitNrf24xx()
{
    GPIO_InitTypeDef GPIO_InitType          = { 0 };
    
    GPIO_InitType.Pin                       = CHIP_ENABLE_GPIO_PIN;
    GPIO_InitType.Mode                      = GPIO_MODE_OUTPUT_PP;
    GPIO_InitType.Pull                      = GPIO_PULLUP;
    
    RCC_CHIP_ENABLE_GPIO_CLOCK_ENABLE();
    HAL_GPIO_Init(CHIP_ENABLE_GPIO_PORT, &GPIO_InitType);
    
    GPIO_InitType.Pin                       = INTERRUPT_REQUEST_GPIO_PIN;
    GPIO_InitType.Mode                      = GPIO_MODE_IT_FALLING;
    GPIO_InitType.Pull                      = GPIO_NOPULL;
    
    RCC_INTERRUPT_REQUEST_GPIO_CLOCK_ENABLE();
    HAL_GPIO_Init(INTERRUPT_REQUEST_GPIO_PORT, &GPIO_InitType);
    
    HAL_NVIC_SetPriority(INTERRUPT_REQUEST_GPIO_IRQN, 1U, 0U);
    HAL_NVIC_EnableIRQ(INTERRUPT_REQUEST_GPIO_IRQN);
    
    InitSerialPeripheralInterfaces();
    
    SelectSlave(SlaveDeselectedSignal);
    ChipEnable(ChipEnabled);
}

inline static void ChipEnable(ChipEnablements enablement)
{
    switch (enablement)
    {
        case ChipEnabled:
            /*  Reset the CE pin to enable the chip.    */
            HAL_GPIO_WritePin(CHIP_ENABLE_GPIO_PORT, CHIP_ENABLE_GPIO_PIN, GPIO_PIN_SET);
        
        break;
        
        case ChipDisabled:
            /*  Reset the CE pin to enable the chip.    */
            HAL_GPIO_WritePin(CHIP_ENABLE_GPIO_PORT, CHIP_ENABLE_GPIO_PIN, GPIO_PIN_RESET);
        
        break;
    }
}

inline static uint8_t ReadRegister(uint8_t reg)
{
    uint8_t command = READ_COMMAND_AND_STATUS_REGISTERS | reg, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK == statusType)
    {        
        uint8_t value;
        
        statusType = SpiReceive(&value, 1);
        
        if (HAL_OK == statusType)
            return value;
    }
    
    SelectSlave(SlaveDeselectedSignal);
    
    return NOP;
}

inline static uint8_t WriteRegister(uint8_t reg, uint8_t value)
{
    uint8_t command = WRITE_COMMAND_AND_STATUS_REGISTERS | reg, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&reg, &status, 1);
    if (HAL_OK == statusType)
        statusType = SpiTransmit(&value, 1);
    
    SelectSlave(SlaveDeselectedSignal);
    
    return status;
}

inline static HAL_StatusTypeDef FlushRxFifo()
{
    uint8_t command = FLUSH_RX_FIFO, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    SelectSlave(SlaveDeselectedSignal);
    
    return statusType;
}

inline static HAL_StatusTypeDef FlushTxFifo()
{
    uint8_t command = FLUSH_TX_FIFO, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    SelectSlave(SlaveDeselectedSignal);
    
    return statusType;
}

inline static uint8_t CheckStatus(void)
{
    uint8_t command = NOP, status = NOP;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK != statusType)
        status = NOP;
    
    SelectSlave(SlaveDeselectedSignal);
    
