halfroad/Arm/Experiments/v9.0/STM32H563ZIT6/Wireless/WirelessReceiver/Sources/Applications/User/Peripherals/Wireless/Nrf24xx/Sources/Nrf24xx.c
    return status;
}

inline static uint8_t CheckFifoStatus(void)
{
    return ReadRegister(FIFO_STATUS);
}


inline static void AssignRxPayloadWidth(uint8_t width)
{
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_0, width);
}

inline static void ClearRxDataRegister(void)
{
    uint8_t status = CheckStatus();
    
    status |= 0x40;
    
    WriteRegister(STATUS_REGISTER, status);
}

inline static void ClearTxDataRegister(void)
{
    uint8_t status = CheckStatus();
    
    status |= 0x20;
    
    WriteRegister(STATUS_REGISTER, status);
}

inline static void ClearMaximumRetrialsRegister(void)
{
    uint8_t status = CheckStatus();
    
    status |= 0x10;
    
    WriteRegister(STATUS_REGISTER, status);
}

inline static void PowerUp(void)
{
    uint8_t configurationRegister = ReadRegister(CONFIGURATION_REGISTER);
    
    configurationRegister |= 0x01 << 1;
    
    WriteRegister(CONFIGURATION_REGISTER, configurationRegister);
}

inline static void PowerDown(void)
{
    uint8_t configurationRegister = ReadRegister(CONFIGURATION_REGISTER);
    
    configurationRegister &= 0xFD;
    
    WriteRegister(CONFIGURATION_REGISTER, configurationRegister);
}

inline static void ConfigureCRCLength(CRCLengths length)
{
    uint8_t configurationRegister = ReadRegister(CONFIGURATION_REGISTER);
    
    switch (length)
    {
        case CRCLength0:
            
            configurationRegister &= 0xFB;
        
            break;
        
        case CRCLength1:
            
            configurationRegister |= 0x01 << 2;
        
            break;
        
        default:
            break;
    }
    
    WriteRegister(CONFIGURATION_REGISTER, configurationRegister);
}

inline static void SetAddressWidth(uint8_t width)
{
    WriteRegister(SETUP_OF_ADDRESS_WIDTHS, width - 2);
}

inline static void SetAutoRetransmissionsNumber(uint8_t number)
{
    uint8_t automaticRetransmission = ReadRegister(SETUP_OF_AUTOMATIC_RETRANSMISSION);
    
    automaticRetransmission |= 0x0F;
    automaticRetransmission |= number;
    
    WriteRegister(SETUP_OF_AUTOMATIC_RETRANSMISSION, automaticRetransmission);
}

inline static void SetAutoRetransmissionsDelay(uint16_t microseconds)
{
    uint8_t automaticRetransmission = ReadRegister(SETUP_OF_AUTOMATIC_RETRANSMISSION);
    
    automaticRetransmission |= 0x0F;
    automaticRetransmission |= (microseconds / 250 - 1) << 4;
    
    WriteRegister(SETUP_OF_AUTOMATIC_RETRANSMISSION, automaticRetransmission);
}

inline static void SetRadioFrequencyChannel(uint16_t mhz)
{
    uint16_t channel = mhz - 2400;
    
    WriteRegister(RF_CHANNEL, channel);
}

inline static void SetTxOutputPower(TxOutputPowers power)
{
    uint8_t RFSetupRegister = ReadRegister(RF_SETUP_REGISTER) & 0xF9;
    
    RFSetupRegister |= power << 1;
    
    WriteRegister(RF_SETUP_REGISTER, RFSetupRegister);
}

inline static void SetRadioFrequencyDataRate(RadioFrequencyDataRates rate)
{
    uint8_t RFSetupRegister = ReadRegister(RF_SETUP_REGISTER) & 0xD7;
    
    switch (rate)
    {
        case RadioFrequencyDataRate250kpbs:
            
            RFSetupRegister |= 0x01 << 5;
        
            break;
        
        case RadioFrequencyDataRate1Mpbs:
            break;
        
        case RadioFrequencyDataRate2Mbps:
            
            RFSetupRegister |= 0x01 << 3;
        
            break;
        
        default:
            break;
    }
    
    WriteRegister(RF_SETUP_REGISTER, RFSetupRegister);
}

inline static HAL_StatusTypeDef ReadRxFifo(uint8_t *payload)
{
    uint8_t command = READ_RX_PAYLOAD, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK == statusType)
        statusType = SpiReceive(payload, PAYLOAD_WIDTH);
    
    SelectSlave(SlaveDeselectedSignal);
    
    return statusType;
}

inline static HAL_StatusTypeDef WriteTxFifo(uint8_t *payload)
{
    uint8_t command = WRITE_TX_PAYLOAD, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK == statusType)
        statusType = SpiTransmit(payload, PAYLOAD_WIDTH);

    SelectSlave(SlaveDeselectedSignal);
    
    return statusType;
}

inline static void Reset(void)
{
    SelectSlave(SlaveDeselectedSignal);
    ChipEnable(ChipDisabled);
    
    WriteRegister(CONFIGURATION_REGISTER, 0x08);
    WriteRegister(ENABLE_AUTO_ACKNOWLEDGMENT, 0x3F);
    WriteRegister(ENABLED_RX_ADDRESSES, 0x3F);
    WriteRegister(SETUP_OF_ADDRESS_WIDTHS, 0x3F);
    WriteRegister(SETUP_OF_AUTOMATIC_RETRANSMISSION, 0x3F);
    
    WriteRegister(RF_CHANNEL, 0x03);
    WriteRegister(RF_SETUP_REGISTER, 0x07);
    WriteRegister(STATUS_REGISTER, 0x7E);
    
    
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_0, 0x00);
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_1, 0x00);
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_2, 0x00);
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_3, 0x00);
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_4, 0x00);
    WriteRegister(NUMBER_OF_BYTES_IN_RX_PAYLOAD_IN_DATA_PIPE_5, 0x00);
    
    WriteRegister(FIFO_STATUS  , 0x11);
    
    WriteRegister(ENABLE_DYNAMIC_PAYLOAD_LENGTH, 0x00);
    WriteRegister(FEATURE_REGISTER, 0x00);
    
    FlushRxFifo();
    FlushTxFifo();
}

inline static HAL_StatusTypeDef SetRxAddress(void)
{
    uint8_t command = WRITE_COMMAND_AND_STATUS_REGISTERS | RX_ADDRESS_DATA_PIPE_0, status;
    
    SelectSlave(SlaveSelectedSignal);
    
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK == statusType)
        statusType = SpiTransmit((uint8_t *)RECEIVER_ADDRESS, ADDRESS_WIDTH);

    SelectSlave(SlaveDeselectedSignal);
    
    return statusType; 
}

inline static HAL_StatusTypeDef SetTxAddress(void)
{
    uint8_t command = WRITE_COMMAND_AND_STATUS_REGISTERS | TX_ADDRESS, status;
    
    SelectSlave(SlaveSelectedSignal);
    
