halfroad/Arm/Experiments/v9.0/STM32H563ZIT6/Wireless/WirelessReceiver/Sources/Applications/User/Peripherals/Wireless/Nrf24xx/Sources/Nrf24xx.c
    HAL_StatusTypeDef statusType = SpiTransceive(&command, &status, 1);
    
    if (HAL_OK == statusType)
        statusType = SpiTransmit((uint8_t *)TRANSMITTER_ADDRESS, ADDRESS_WIDTH);

    SelectSlave(SlaveDeselectedSignal);
    
    return statusType; 
}

inline static void SwitchToRxMode(void)
{
    uint8_t configurationRegister = ReadRegister(CONFIGURATION_REGISTER);
    
    configurationRegister|= 0x01 << 0;
    
    WriteRegister(CONFIGURATION_REGISTER, configurationRegister);
}

inline static void SwitchToTxMode(void)
{
    uint8_t configurationRegister = ReadRegister(CONFIGURATION_REGISTER);
    
    configurationRegister &= 0xFE;
    
    WriteRegister(CONFIGURATION_REGISTER, configurationRegister);
}

HAL_StatusTypeDef Nrf24xxTransmit(uint8_t *payload)
{
    return WriteTxFifo(payload);
}

HAL_StatusTypeDef Nrf24xxReceive(uint8_t *payload)
{
    HAL_StatusTypeDef statusType = ReadRxFifo(payload);
    
    ClearRxDataRegister();
    
    return statusType;
}

void Nrf24xxRxInit(uint16_t channel, RadioFrequencyDataRates rate)
{
    Reset();
    
    InitNrf24xx();
    
    SwitchToRxMode();
    
    SetRxAddress();
    
    PowerUp();
    
    AssignRxPayloadWidth(PAYLOAD_WIDTH);
    
    SetRadioFrequencyChannel(channel);
    SetRadioFrequencyDataRate(rate);
    SetTxOutputPower(TxOutputPower0dBm);
    
    ConfigureCRCLength(CRCLength0);
    
    SetAddressWidth(ADDRESS_WIDTH);
    
    SetAutoRetransmissionsNumber(TX_MAXIMUM_RETRILS);
    SetAutoRetransmissionsDelay(250);
    
    ChipEnable(ChipEnabled);
}

void Nrf24xxTxInit(uint16_t channel, RadioFrequencyDataRates rate)
{
    InitNrf24xx();
    
    Reset();
    
    SwitchToTxMode();
    
    SetTxAddress();
    SetRxAddress();
    
    PowerUp();

    SetRadioFrequencyChannel(channel);
    SetRadioFrequencyDataRate(rate);
    SetTxOutputPower(TxOutputPower0dBm);
    
    ConfigureCRCLength(CRCLength0);
    
    SetAddressWidth(ADDRESS_WIDTH);
    
    SetAutoRetransmissionsNumber(TX_MAXIMUM_RETRILS);
    SetAutoRetransmissionsDelay(250);
    
    ChipEnable(ChipEnabled);
}

void INTERRUPT_REQUEST_GPIO_IRQHandler(void)
{
    HAL_GPIO_EXTI_IRQHandler(INTERRUPT_REQUEST_GPIO_PIN);
}